# 6. Найти сумму цифр числа.
fig = input('введите цифру')
for el in fig:
    print(el)